In [9]:
import pandas as pd
import numpy as np

## Series

In [6]:
#class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
# pandas.Series.str       # Str
# pandas.Series.dt        # Datetime
# pandas.Series.cat       # The categories
# pandas.Series.plot

In [11]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [17]:
ser.array

<PandasArray>
[1, 2, 3]
Length: 3, dtype: int64

## Series To DataFrame

In [112]:
s1 = pd.Series([1, 2, 3])
s1

0    1
1    2
2    3
dtype: int64

In [113]:
s2 = pd.Series(['Jon','Mark','Maria'],name="Name")
s2

0      Jon
1     Mark
2    Maria
Name: Name, dtype: object

In [118]:
s3 = pd.Series(['Anderson','Smith','Green'])
s3

0    Anderson
1       Smith
2       Green
dtype: object

In [119]:
s4= pd.Series([23,57,42])
s4

0    23
1    57
2    42
dtype: int64

In [135]:
# Series to Dataframe
s3.to_frame()
pd.DataFrame(s3,columns =['First Name'])

  First Name
0   Anderson
1      Smith
2      Green

In [131]:
# Add Columns Name
pd.DataFrame(s3,columns =['Last Name'])
pd.DataFrame(s3).rename(columns = {0:'Last Name'})

  Last Name
0  Anderson
1     Smith
2     Green

In [133]:
pd.DataFrame(s1).rename(columns = {0:'S No.'})

   S No.
0      1
1      2
2      3

In [134]:
pd.DataFrame(s4).rename(columns = {0:'Age'})

   Age
0   23
1   57
2   42

In [143]:
# pd.concat([s1.to_frame(), s2.to_frame(), s3.to_frame()], axis=1)
pd.concat([s1, s2, s3,s4], axis=1).rename(columns = {0:'RollNo.',1:"LastName",2:"Age","Name":"FirstName"})

   RollNo. FirstName  LastName  Age
0        1       Jon  Anderson   23
1        2      Mark     Smith   57
2        3     Maria     Green   42

## DataTime

In [19]:
rng = pd.date_range('1/1/2011', periods=72, freq='H')

In [20]:
# rng = pd.date_range('1/1/2011', periods=10, freq='M')
# rng

In [22]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts.head()

2011-01-01 00:00:00    0.030560
2011-01-01 01:00:00   -0.978446
2011-01-01 02:00:00    0.776104
2011-01-01 03:00:00    0.603654
2011-01-01 04:00:00    0.294372
                         ...
2011-01-03 19:00:00    0.433772
2011-01-03 20:00:00   -0.462500
2011-01-03 21:00:00    1.232247
2011-01-03 22:00:00   -0.926171
2011-01-03 23:00:00    1.215438
Freq: H, Length: 72, dtype: float64

In [24]:
converted = ts.asfreq('45Min', method='pad')
converted.head()

2011-01-01 00:00:00    0.030560
2011-01-01 00:45:00    0.030560
2011-01-01 01:30:00   -0.978446
2011-01-01 02:15:00    0.776104
2011-01-01 03:00:00    0.603654
Freq: 45T, dtype: float64

In [27]:
ts.resample('D').mean()

2011-01-01    0.212463
2011-01-02    0.013523
2011-01-03    0.007612
Freq: D, dtype: float64

In [28]:
pd.Period('2012-05', freq='D')

Period('2012-05-01', 'D')

In [ ]:
df['Datetime'] =  pd.to_datetime(df['Datetime'], format='%d/%m/%Y %H:%M:%S')

## Dataframe

In [145]:
pd_dataframe=pd.DataFrame(None ,columns=['Name','Roll No.','Marks'])
pd_dataframe

Empty DataFrame
Columns: [Name, Roll No., Marks]
Index: []

In [158]:
pd_dataframe = pd.DataFrame([[1, 2]], columns=list('AB'))
pd_dataframe

   A  B
0  1  2

In [194]:
pd.DataFrame({'x': [1], 'y': [3]})

   x  y
0  1  3

In [165]:
list_2d=[['a',1,500],
         ['b',2,600],
         ['c',3,700]]
pd_dataframe=pd.DataFrame(list_2d,columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
pd_dataframe

   Name  Roll No.  Marks
R1    a         1    500
R2    b         2    600
R3    c         3    700

In [166]:
# Save DataFrame csv
pd_dataframe.to_csv('temp/Pandas_without_index.csv',index=False)
pd_dataframe.to_csv('temp/Pandas_with_index.csv',index=True)

In [167]:
# pd_dataframe1=pd.DataFrame(list_2d,columns=['Name',])
pd_dataframe['Name'].to_csv('temp/Pandas_single_Columns.csv',index=False)

### Selection

In [171]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4),index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01  1.499144 -0.795219  0.750437 -2.326872
2000-01-02  0.350067 -1.209415 -1.009308  0.030305
2000-01-03 -0.987734  0.122962 -0.972986 -0.325991
2000-01-04  0.337809 -0.046338 -1.367413 -0.845532
2000-01-05 -0.611303 -0.427272 -0.545391 -1.610856
2000-01-06 -1.697865  1.131130  0.382143  0.387010
2000-01-07 -2.751061 -1.799327  0.656965  0.200469
2000-01-08 -0.471468  0.796391 -0.138702  0.025351

**Attribute**

In [200]:
# df.A

In [201]:
# df['A']

In [202]:
# df[['A', 'B']]

**Slicing with labels & Range**

In [204]:
# df[:2]

In [205]:
# s[::-1]

In [203]:
# df.loc[:, ['B', 'A']]

In [209]:
# df.iloc[:,1:]

### Mearge Two Table

In [ ]:
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'],index=['r1','r2','r3'])
df1

df2=pd.DataFrame([['d',1,500],['e',2,600],['f',3,700]],columns=['name','roll','marks'],index=['r4','r5','r5'])
df2

df1.append(df2)

df1.append(df2,ignore_index=True)

df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'],index=['r1','r2','r3'])
df1
df2=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll2','marks2'],index=['r1','r2','r3'])
df2

result = pd.merge(df1,
                 df2[['name','roll2','marks2']],
                 on='name')
result.head()

# “left”, “right”, “inner” (default), or “outer”.
![](Join.png)


df3=pd.merge(df1,df2[['name','roll2','marks2']],on='name',how='left',indicator=True)
df3

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])
 

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])
frames = [df1, df2, df3]
result = pd.concat(frames)
result

- objs : a sequence or mapping of Series or DataFrame objects. If a dict is passed, the sorted keys will be used as the keys argument, unless it is passed, in which case the values will be selected (see below). Any None objects will be dropped silently unless they are all None in which case a ValueError will be raised.
- axis : {0, 1, …}, default 0. The axis to concatenate along.
- join : {‘inner’, ‘outer’}, default ‘outer’. How to handle indexes on other axis(es). Outer for union and inner for intersection.
- ignore_index : boolean, default False. If True, do not use the index values on the concatenation axis. The resulting axis will be labeled 0, …, n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information. Note the index values on the other axes are still respected in the join.
- keys : sequence, default None. Construct hierarchical index using the passed keys as the outermost level. If multiple levels passed, should contain tuples.
- levels : list of sequences, default None. Specific levels (unique values) to use for constructing a MultiIndex. Otherwise they will be inferred from the keys.
- names : list, default None. Names for the levels in the resulting hierarchical index.
- verify_integrity : boolean, default False. Check whether the new concatenated axis contains duplicates. This can be very expensive relative to the actual data concatenation.
- copy : boolean, default True. If False, do not copy data unnecessarily.


result = pd.concat(frames, keys=['x', 'y', 'z'])
result

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])
 
df2 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                   'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                index=[2, 3, 6, 7])
result = pd.concat([df1, df2], axis=1, sort=False)
result

result = pd.concat([df1, df4], axis=1, join='inner')

In [ ]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
pd_dataframe.append(df2,ignore_index=True)